app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "name", "number", "surname", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 23 Mar 2014 15:52:06 UTC +00:00], ["name", "alessandro"], ["number", "07745045057"], ["surname", "cabbia"], ["updated_at", Sun, 23 Mar 2014 15:52:06 UTC +00:00]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "surname" = ?, "updated_at" = ? WHERE "contacts"."id" = 5  [["surname", "hakjshdkja"], ["updated_at", Sun, 23 Mar 2014 16:13:29 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)